{
    "error": {
        "title": "Page d'erreur !",
        "http": {
            "400": "Mauvaise requête.",
            "403": "Vous n'avez pas les droits pour accéder à cette page.",
            "404": "La page n'existe pas.",
            "405": "Le verbe HTTP que vous avez utilisé n'est pas reconnu par cet URL.",
            "500": "Erreur interne du serveur."
        },
        "concurrencyFailure": "Un autre utilisateur a modifié ces données en même temps que vous. Vos changements n'ont pas été sauvegardés.",
        "validation": "Erreur de validation côté serveur.",
        "quittance": {
            "qittanceRectificativeSansQuittanceInitiale": "Cette quittance rectificative ne possède pas de quittance initiale associée",
            "anneeNonValide": "Annee non valide",
            "moisNonValide": "mois non valide",
            "quittancePrecedenteNonValide": "La quittance du mois précédent n'est pas validée! Valider la en saisissant son numéro et la date de paiement pour continuer!",
            "quittanceInitialeInexistante": "Il existe déjà une quittance initiale pour ce mois. Editer la ou créer une quittance pour un autre mois!",
            "quittanceInitialeNonValidee": "Impossible de créer une quittance rectificative pour ce mois avant de valider la quittance initiale par saisie du numéro et de la date de paiement!",
            "quittanceRectificativeInexistante": "Il existe déjà une quittance rectificative pour ce mois. Editer la ou créer une quittance pour un autre mois!",
            "quittancePrecedenteInexistante": "Il n'existe pas de quittance pour le mois précédent",
            "quittanceASussuprimerNonExistante": "La quittance a supprimée dont l'id est {{id}} n'existe pas!",
            "quittanceASupprimerValidee": "Cette quittance dont l'id est {{id}} ne peut pas être supprimée car elle est déjà validée!",
            "quittanceRectificativeAsupprimerPossedePasQuittanceInitiale": "Cette quittance retificative à supprimer dont l'id est {{id}} ne possède pas d equittance initiale à tort!"
        },
        "acompte": {
            "numeroNonValide": "Numéro acompte non valide",
            "acompteInitialeInexistante": "Il existe déjà un acompte initiale avec ce numéro. Editer avec ce numéro. Editer le ou créer un acompte avec un autre numéro!",
            "acompteRectificativeExistante": "Il existe déjà un acompte rectificatif avec ce numéro. Editer le ou créer un acompte avec un autre numéro!"
        }
    }
}
